stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
/**
 * @file main.cpp
 * @brief ESP32 All-In-One Agricultural Controller Main Application
 * 
 * This file contains the main application logic for the ESP32-AIO agricultural controller.
 * It manages GPS, steering control, wireless communication, web interface, and various
 * hardware peripherals for precision agriculture applications.
 * 
 * @author Steve Nolte
 * @date 2025
 * @version 1.0
 * 
 * Features:
 * - GPS/IMU integration with UM982 and BNO08x
 * - Wheel Angle Sensor (WAS) support (wired/wireless)
 * - PID-based steering control
 * - Web-based configuration interface
 * - Serial command interface
 * - Recovery mode for field servicing
 * - Power cycle detection using RTC memory
 * - UDP communication for AgOpen GPS integration
 */
#define FORCE_AP_MODE false
// force build
#include <Arduino.h>
#include "nvs_flash.h"
#include "ESPdata.h"
#include "ESPWifi.h"
#include "myLED.h"
#include "Wire.h"
#include "ESPudp.h"
// #include "Adafruit_MCP23X17.h"
#include "I2C_Manager.h"
// #include "Indicators.h"
#include "MainPower.h"
#include "GPS.h"
#include "HardwareSerial.h"
#include "ESP32OTAPull.h"
#include "ESPsteer.h"
#include <ESPAsyncWebServer.h>
#include <AsyncWebSocket.h>
#include <LittleFS.h>
#include <WiFi.h>
#include <ArduinoJson.h>
#include "esp_system.h"

//TODO: add wifi connect timer to ap mode

/// @brief I2C bus 0 for primary peripherals
TwoWire twoWire = TwoWire(0);
/// @brief I2C bus 1 for secondary peripherals  
// TwoWire twoWire1 = TwoWire(1);
// /// @brief Hardware serial port 2 for BNO08x IMU communication
HardwareSerial bnoSerial(2);
/// @brief Hardware serial port 1 for GPS communication
HardwareSerial gpsSerial(1);

// Using singleton pattern - single access point for configuration
/// @brief Global configuration and data storage singleton instance
ESPdata& espData = ESPdata::getInstance();
/// @brief I2C Manager singleton instance for centralized bus management
I2CManager& i2cManager = I2CManager::getInstance();
/// @brief GPS/IMU manager with UM982 GPS and BNO08x IMU support
ESPGPS gps(&espData, &gpsSerial, &bnoSerial);  // MCPManager accessed via singleton inside class
/// @brief LED status indicator controller with error state management
MyLED myLED(&espData);
/// @brief Main power control and monitoring system
MainPower mainPower(&espData);  // Will be migrated to use ADSManager
/// @brief WiFi connection and AP mode manager
ESPWifi espWifi(&espData);
/// @brief UDP communication handler for AgOpen GPS protocol
ESPudp espUdp(&espData);
/// @brief Over-The-Air firmware update manager
ESP32OTAPull ota;
/// @brief Async web server for configuration interface (port 80)
AsyncWebServer server(80);
/// @brief WebSocket server for real-time serial monitoring
// AsyncWebSocket ws("/ws");

/// @brief Steering control system with PID feedback and motor control
ESPsteer espSteer(&espData);  // Will be migrated to use ADSManager
/// @brief Simple I2C Manager for centralized bus access

/// @brief Debug variables vector for web interface display
std::vector<String> debugVars;

/// @brief Debug mode flag - true for full debug, false for minimal
bool fullDebugMode = false;

// WebSocket Serial Monitor Variables
// String serialBuffer = "";
// const size_t MAX_SERIAL_BUFFER = 8192;  // 8KB buffer

/**
 * @brief Custom serial print function that also sends to WebSocket clients
 * @param message Message to print to both serial and WebSocket
 */
void webSerial(const String& message) {
    // Print to hardware serial
    // Serial.print(message);
    
    // // Add to buffer for WebSocket clients
    // serialBuffer += message;
    
    // // Limit buffer size
    // if (serialBuffer.length() > MAX_SERIAL_BUFFER) {
    //     serialBuffer = serialBuffer.substring(serialBuffer.length() - MAX_SERIAL_BUFFER);
    // }
    
    // // Send to all connected WebSocket clients
    // ws.textAll(message);
}

// /**
//  * @brief WebSocket event handler for serial monitor
//  */
// void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len) {
//     if (type == WS_EVT_CONNECT) {
//         webSerial("WebSocket client #" + String(client->id()) + " connected from " + client->remoteIP().toString() + "\n");
        
//         // Send welcome message to new WebSocket client
//         String welcomeMsg = "\n===== ESP32-AIO Serial Monitor =====\n";
//         welcomeMsg += "System: " + String(ARDUINO_BOARD) + "\n";
//         welcomeMsg += "MAC: " + WiFi.macAddress() + "\n";
//         welcomeMsg += "IP: " + WiFi.localIP().toString() + "\n";
//         welcomeMsg += "Version: " + String(VERSION) + "\n";
//         welcomeMsg += "Available commands: clear, restart, status\n";
//         welcomeMsg += "====================================\n\n";
//         client->text(welcomeMsg);
        
//         // Send current buffer to newly connected client
//         if (serialBuffer.length() > 0) {
//             client->text("=== ESP32-AIO Serial Monitor Connected ===\n");
//             client->text("System: " + String(NAME) + " v" + String(VERSION) + "\n");
//             client->text("Uptime: " + String(millis()/1000) + " seconds\n");
//             client->text("=========================================\n");
//             client->text(serialBuffer);
//         }
        
//     } else if (type == WS_EVT_DISCONNECT) {
//         webSerial("WebSocket client #" + String(client->id()) + " disconnected\n");
        
//     } else if (type == WS_EVT_DATA) {
//         // Handle incoming WebSocket data (commands from web interface)
//         AwsFrameInfo *info = (AwsFrameInfo*)arg;
//         if (info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT) {
//             data[len] = 0;  // Null terminate
//             String command = String((char*)data);
//             command.trim();
            
//             // Process web-based serial commands
//             webSerial("Web Command: " + command + "\n");
            
//             // Process commands
//             if (command == "clear") {
//                 serialBuffer = "";
//                 // ws.textAll(""); // Clear all clients
//             } else if (command == "restart") {
//                 webSerial("Restarting ESP32...\n");
//                 delay(1000);
//                 ESP.restart();
//             } else if (command == "status") {
//                 webSerial("System Status:\n");
//                 webSerial("  Uptime: " + String(millis()/1000) + " seconds\n");
//                 webSerial("  Free Heap: " + String(ESP.getFreeHeap()) + " bytes\n");
//                 webSerial("  WiFi: " + String(WiFi.status() == WL_CONNECTED ? "Connected" : "Disconnected") + "\n");
//                 webSerial("  Program State: " + String(espData.program.state) + "\n");
//             }
//         }
//     }
// }

// Function declarations
/**
 * @brief Update debug variables for normal operation mode
 */
void updateDebugVars();

/**
 * @brief Get FreeRTOS task statistics including CPU usage
 */
void getTaskStats(std::vector<String>& stats);

/**
 * @brief Update debug variables for recovery mode
 */
void updateRecoveryDebugVars();

/**
 * @brief Initialize and start recovery mode with minimal functionality
 */
void recoveryBoot();

/**
 * @brief Initialize and start normal operation mode with full functionality
 */
void normalboot();

/**
 * @brief Initializes I2C bus and detects connected hardware components
 * 
 * @details This function configures the I2C interface and scans for essential hardware:
 *          - Sets up I2C pins (SDA/SCL) from configuration
 *          - Initializes the Wire library for I2C communication
 *          - Scans for MCP23017 I/O expander at address 0x20
 *          - Scans for ADS1115 ADC at address 0x48
 *          - Updates component state flags in espData structure
 * 
 * @return true if all required hardware components are detected
 * @return false if any essential component is missing or I2C setup fails
 * 
 * @note Both MCP23017 and ADS1115 are required for normal operation
 * @see normalboot(), espData.program.mcpState, espData.program.adsState
 */
bool I2Csetup(){
  if(!twoWire.setPins(espData.pins.SDA_PIN, espData.pins.SCL_PIN)){
    webSerial("Wire failed to set pins\n");
    return false;
  }
 
