stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  // GPS data - simplified to reduce stack usage
  debugVars.push_back("GPS Data: ");
  debugVars.push_back("..GPS Mode: " + String(espData.gps.ntripPandaMode ? "PANDA Generation" : "Raw NMEA"));
  debugVars.push_back("..Fix Time: " + String(espData.gps.fixTime));
  debugVars.push_back("..Fix Quality: " + String(espData.gps.fixQuality));
  debugVars.push_back("..Satellites: " + String(espData.gps.numSats));
  debugVars.push_back("..Latitude: " + String(espData.gps.latitude));
  debugVars.push_back("..Longitude: " + String(espData.gps.longitude));
  debugVars.push_back("..Altitude: " + String(espData.gps.altitude));
  debugVars.push_back("..Speed: " + String(espData.gps.speedKnots));
  debugVars.push_back("..Heading: " + String(espData.gps.vtgHeading));
  debugVars.push_back("..HDOP: " + String(espData.gps.HDOP));
  debugVars.push_back("..Last PANDA: " + String(espData.gps.nmea));
  debugVars.push_back("..Message Counts");
  debugVars.push_back("....GGA: " + String(espData.gps.ggaMessageCount));
  debugVars.push_back("....RMC: " + String(espData.gps.rmcMessageCount));
  debugVars.push_back("....GSA: " + String(espData.gps.gsaMessageCount));
  debugVars.push_back("....VTG: " + String(espData.gps.vtgMessageCount));
  debugVars.push_back("....Other:" + String(espData.gps.otherMessageCount)); 
  debugVars.push_back("....PANDA Sent: " + String(espData.gps.pandaMessageCount));
  debugVars.push_back("..Last PANDA Time: " + String((float)(espData.gps.lastPandaTime)/1000.0, 2) + "s");
  // Calculate and display PANDA message frequency
  if (espData.gps.pandaMessageCount > 1 && espData.gps.firstPandaTime > 0) {
    float elapsedTime = (millis() - espData.gps.firstPandaTime) / 1000.0; // Convert to seconds
    float frequency = (espData.gps.pandaMessageCount - 1) / elapsedTime; // Messages per second
    debugVars.push_back("..PANDA Frequency: " + String(frequency, 2) + " Hz");
  } else {
    debugVars.push_back("..PANDA Frequency: N/A");
  } 
  debugVars.push_back("..IMU State: " + String(espData.gps.imuState));
  debugVars.push_back("....IMU Heading: " + String(espData.gps.imuHeading));
  debugVars.push_back("....IMU Pitch: " + String(espData.gps.imuPitch));
  debugVars.push_back("....IMU Roll: " + String(espData.gps.imuRoll));
  // NTRIP correction data statistics
  debugVars.push_back("..NTRIP Data: ");
  debugVars.push_back("....Packets Received: " + String(espData.gps.ntripPacketCount));
  debugVars.push_back("....Total Bytes: " + String(espData.gps.ntripTotalBytes));
  debugVars.push_back("....Last Packet Time: " + String((float)(espData.gps.lastNtripTime)/1000.0, 2) + "s");
  // Calculate and display NTRIP packet frequency
  if (espData.gps.ntripPacketCount > 1 && espData.gps.firstNtripTime > 0) {
    float elapsedTime = (millis() - espData.gps.firstNtripTime) / 1000.0;
    float frequency = (espData.gps.ntripPacketCount - 1) / elapsedTime;
    debugVars.push_back("....Packet Frequency: " + String(frequency, 2) + " Hz");
    if (espData.gps.ntripTotalBytes > 0) {
      float bytesPerSec = espData.gps.ntripTotalBytes / elapsedTime;
      debugVars.push_back("....Data Rate: " + String(bytesPerSec, 1) + " B/s");
    }
  } else {
    debugVars.push_back("....Packet Frequency: N/A");
  }
  // Steering data - essential only
  debugVars.push_back("Steer Data: ");
  debugVars.push_back("..Target Angle: " + String(espData.steer.targetSteerAngle, 2));
  debugVars.push_back("..Actual Angle: " + String(espData.steer.actSteerAngle, 2));
  debugVars.push_back("..Raw ADS: " + String(espData.steer.rawADS));
  debugVars.push_back("..PWM Command: " + String(espData.steer.pwmCmd));
  debugVars.push_back("..Switch State: " + String(espData.steer.switchState));
  debugVars.push_back("..Current Debug: " + String(espData.steer.enableCurrentDebug ? "ON" : "OFF"));
  debugVars.push_back("..Motor Current: ");
  debugVars.push_back("....Filtered Value: " + String(espData.steer.steerCurrent));
  debugVars.push_back("....Raw ADC: " + String(espData.steer.rawCurrentADC));
  debugVars.push_back("....Pre-Filter: " + String(espData.steer.currentBeforeFilter, 2));
  debugVars.push_back("....Zero Point: " + String(espData.steer.currentZero));
  debugVars.push_back("....Scaler: " + String(espData.steer.currentScaler, 2));
  debugVars.push_back("....Current Filter: " + String(espData.steer.currentFilter, 2));
  debugVars.push_back("....Direction: " + String(espData.steer.motorDirection == 0 ? "STOP" : (espData.steer.motorDirection == 1 ? "CW" : "CCW")));
  debugVars.push_back("..Current Limit Protection: ");
  debugVars.push_back("....Enabled: " + String(espData.steer.enableCurrentLimit ? "YES" : "NO"));
  debugVars.push_back("....Limit: " + String(espData.steer.currentLimit));
  debugVars.push_back("....Tripped: " + String(espData.steer.currentLimitTripped ? "YES" : "NO"));
  debugVars.push_back("....Steer Status: " + String(espData.steer.status));
  // PGN 253 Byte 11 bit states
  uint8_t byte11 = 0x00;
  if (espData.joystick.switchStates[6] == 1) byte11 |= 0x01;
  if (espData.steer.currentLimitTripped) byte11 |= 0x02;
  if (espData.joystick.switchStates[7] == 1) byte11 |= 0x04;
  debugVars.push_back("....PGN 253 Byte 11: 0x" + String(byte11, HEX));
  debugVars.push_back("......Bit 0 (Work Switch): " + String((byte11 & 0x01) ? "SET" : "CLEAR"));
  debugVars.push_back("......Bit 1 (Steer Switch): " + String((byte11 & 0x02) ? "SET (DISABLED)" : "CLEAR (ENABLED)"));
  debugVars.push_back("......Bit 2 (Remote Switch): " + String((byte11 & 0x04) ? "SET" : "CLEAR"));
  if (espData.steer.currentLimitTripped) {
    int timeRemaining = (int)(espData.steer.currentLimitResetTime - millis());
    debugVars.push_back("....Reset In: " + String(timeRemaining > 0 ? timeRemaining/1000.0 : 0.0, 1) + "s");
  }
  
  // ADS readings - simplified
  debugVars.push_back("ADS1115 INFO");
  for(int i = 0; i < 4; i++) {
    debugVars.push_back("..Ch" + String(i) + ": " + String(i2cManager.getVoltage(i), 3) + "V");
  }

  // Loop timing diagnostics - confirm ADS read does not block
  debugVars.push_back("Loop Timing Diagnostics:");
  debugVars.push_back("..Steer Loop Time: " + String(espData.steer.looptime) + "ms");
  debugVars.push_back("..I2C Task Cycle Time: " + String(i2cManager.getI2CTaskCycleTime()) + "ms");
  debugVars.push_back("..ADS State Machine Time (last): " + String(i2cManager.getADCStateMachineTime()) + "us");
  debugVars.push_back("..ADS State Machine Time (max): " + String(i2cManager.getADCStateMachineMaxTime()) + "us");
  
  // Add CPU/Task statistics
  getTaskStats(debugVars);
  
