stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
}

/**
 * @brief Get FreeRTOS task statistics including CPU usage
 */
void getTaskStats(std::vector<String>& stats) {
  stats.push_back("=== System Statistics ===");
  
  // Get number of tasks
  UBaseType_t taskCount = uxTaskGetNumberOfTasks();
  stats.push_back("Active FreeRTOS tasks: " + String(taskCount));
  stats.push_back("");
  
  // System uptime
  uint32_t uptimeSeconds = millis() / 1000;
  uint32_t days = uptimeSeconds / 86400;
  uint32_t hours = (uptimeSeconds % 86400) / 3600;
  uint32_t minutes = (uptimeSeconds % 3600) / 60;
  uint32_t seconds = uptimeSeconds % 60;
  
  stats.push_back("System Uptime:");
  if (days > 0) {
    stats.push_back("  " + String(days) + " days, " + String(hours) + "h " + String(minutes) + "m " + String(seconds) + "s");
  } else if (hours > 0) {
    stats.push_back("  " + String(hours) + "h " + String(minutes) + "m " + String(seconds) + "s");
  } else {
    stats.push_back("  " + String(minutes) + "m " + String(seconds) + "s");
  }
  stats.push_back("");
  
  // Memory statistics
  stats.push_back("Memory Statistics:");
  stats.push_back("  Free heap: " + String(ESP.getFreeHeap()) + " bytes");
  stats.push_back("  Min free heap: " + String(ESP.getMinFreeHeap()) + " bytes");
  stats.push_back("  Max alloc heap: " + String(ESP.getMaxAllocHeap()) + " bytes");
  
  // Calculate heap fragmentation
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t maxAlloc = ESP.getMaxAllocHeap();
  if (freeHeap > 0) {
    uint32_t fragmentation = 100 - ((maxAlloc * 100) / freeHeap);
    stats.push_back("  Heap fragmentation: " + String(fragmentation) + "%");
  }
  
  // PSRAM if available
  if (ESP.getPsramSize() > 0) {
    stats.push_back("  PSRAM total: " + String(ESP.getPsramSize()) + " bytes");
    stats.push_back("  PSRAM free: " + String(ESP.getFreePsram()) + " bytes");
  }
  stats.push_back("");
  
  // CPU information
  stats.push_back("CPU Information:");
  stats.push_back("  Chip model: " + String(ESP.getChipModel()));
  stats.push_back("  Chip revision: " + String(ESP.getChipRevision()));
  stats.push_back("  CPU cores: " + String(ESP.getChipCores()));
  stats.push_back("  CPU frequency: " + String(ESP.getCpuFreqMHz()) + " MHz");
  stats.push_back("  Flash size: " + String(ESP.getFlashChipSize() / 1024) + " KB");
  stats.push_back("  Flash speed: " + String(ESP.getFlashChipSpeed() / 1000000) + " MHz");
}

/**
 * @brief Updates debug variables specifically for recovery mode display
 * 
 * @details This function populates the debugVars vector with recovery mode
 *          specific information including:
 *          - Recovery mode indicators and timestamps
 *          - Hardware specifications (chip model, CPU frequency, flash)
 *          - Recovery WiFi AP configuration details
 *          - System status and reset reason information
 *          - Memory usage statistics including PSRAM
 *          Used for diagnostics when the system is in recovery mode
 */
void updateRecoveryDebugVars() {
  debugVars.clear(); // Clear the list to update it dynamically
  debugVars.push_back("=== RECOVERY MODE ===");
  debugVars.push_back("Program: " + String(NAME));
  debugVars.push_back("Recovery Boot Timestamp [s]: " + String((float)(millis())/1000.0));
  debugVars.push_back("Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
  debugVars.push_back("Used PSRAM: " + String(ESP.getPsramSize() - ESP.getFreePsram()) + " bytes");
  debugVars.push_back("Version: " + String(VERSION));
  debugVars.push_back("Chip Model: " + String(ESP.getChipModel()));
  debugVars.push_back("Chip Revision: " + String(ESP.getChipRevision()));
  debugVars.push_back("CPU Frequency: " + String(ESP.getCpuFreqMHz()) + " MHz");
  debugVars.push_back("Flash Size: " + String(ESP.getFlashChipSize()) + " bytes");
  debugVars.push_back("Flash Speed: " + String(ESP.getFlashChipSpeed()) + " Hz");
  debugVars.push_back("MAC Address: " + WiFi.macAddress());
  debugVars.push_back("");
  debugVars.push_back("=== RECOVERY WIFI ===");
  debugVars.push_back("AP SSID: " + String(NAME) + "_RECOVERY");
  debugVars.push_back("AP Password: recovery123");
  debugVars.push_back("AP IP: 192.168.4.1");
  debugVars.push_back("WiFi Mode: AP (Access Point)");
  debugVars.push_back("Connected Clients: " + String(WiFi.softAPgetStationNum()));
  debugVars.push_back("");
  debugVars.push_back("=== SYSTEM STATUS ===");
  debugVars.push_back("Config Load Result: " + String(espData.program.confRes));
  debugVars.push_back("Program State: " + String(espData.program.state));
  debugVars.push_back("Reset Reason Core 0: " + String(esp_reset_reason()));
  debugVars.push_back("Reset Reason Core 1: " + String(esp_reset_reason()));
  debugVars.push_back("Wake Reason: " + String(esp_sleep_get_wakeup_cause()));
  debugVars.push_back("");
  debugVars.push_back("=== HARDWARE STATUS ===");
  debugVars.push_back("MCP23017 State: " + String(espData.program.mcpState));
  debugVars.push_back("ADS1115 State: " + String(espData.program.adsState));
  debugVars.push_back("IMU State: " + String(espData.gps.imuState));
  debugVars.push_back("I2C0 SDA/SCL: " + String(SDA) + "/" + String(SCL));
  debugVars.push_back("I2C0 SDA/SCL: " + String(espData.pins.SDA_PIN) + "/" + String(espData.pins.SCL_PIN));
  debugVars.push_back("");
  debugVars.push_back("=== FILE SYSTEM ===");
  debugVars.push_back("LittleFS Total: " + String(LittleFS.totalBytes()) + " bytes");
  debugVars.push_back("LittleFS Used: " + String(LittleFS.usedBytes()) + " bytes");
  debugVars.push_back("LittleFS Free: " + String(LittleFS.totalBytes() - LittleFS.usedBytes()) + " bytes");
  debugVars.push_back("");
  
  // Add CPU/Task statistics for recovery mode
  getTaskStats(debugVars);
  
  debugVars.push_back("");
  debugVars.push_back("=== RECOVERY ACTIONS ===");
  debugVars.push_back("• Upload new firmware via /update");
  debugVars.push_back("• Download/upload config files via /upload");
  debugVars.push_back("• Factory reset via /factoryReset");
  debugVars.push_back("• Force normal boot via /forceNormalBoot");
  debugVars.push_back("• Reboot system via /reboot");
}

// Function to serve the debug variables as JSON
void handleDebugVars(AsyncWebServerRequest *request) {
  webSerial("Normal mode debug handler called\n");
  updateDebugVars();  // Update the debug variables just before sending
  JsonDocument doc;
  JsonArray array = doc.to<JsonArray>();
  
