stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  for (const auto& var : debugVars) {
    String clean = var;
    // Remove control characters that can break JSON parsing in the web client.
    for (size_t i = 0; i < clean.length(); i++) {
      unsigned char c = (unsigned char)clean[i];
      if (c < 0x20 && c != '\t') {
        clean.setCharAt(i, ' ');
      }
    }
    array.add(clean);
  }
  
  String jsonResponse;
  serializeJson(doc, jsonResponse);
  webSerial("Sending " + String(debugVars.size()) + " debug variables\n");
  request->send(200, "application/json", jsonResponse);
}


// Function to serve the file list as JSON
// void handleFileList(AsyncWebServerRequest *request) {
//   DynamicJsonDocument doc(1024);
//   JsonArray array = doc.to<JsonArray>();

//   // Open LittleFS root directory and list files
//   File root = LittleFS.open("/");
//   File file = root.openNextFile();
  
//   while (file) {
//     JsonObject fileObject = array.createNestedObject();
//     fileObject["name"] = String(file.name());
//     fileObject["size"] = file.size();
//     file = root.openNextFile();
//   }

//   String jsonResponse;
//   serializeJson(doc, jsonResponse);
//   request->send(200, "application/json", jsonResponse);
//   Serial.println("Sent File List");
// }

// Steering debug data endpoint - returns all steering-related runtime values as JSON
void handleGetSteerData(AsyncWebServerRequest *request) {
  JsonDocument doc;

  // Control state
  doc["status"]           = espData.steer.status;
  doc["testState"]        = espData.steer.testState;
  doc["steerSwitch"]      = espData.steer.steerSwitch;
  doc["switchState"]      = espData.steer.switchState;
  doc["watchdog"]         = espData.steer.watchdog;

  // Steering angles
  doc["targetAngle"]      = espData.steer.targetSteerAngle;
  doc["actAngle"]         = espData.steer.actSteerAngle;
  doc["rawADS"]           = espData.steer.rawADS;
  doc["sensorVoltage"]    = espData.steer.sensorVoltage;
  doc["wasZeroAngle"]     = espData.steer.wasZeroAngle;
  doc["absAngle"]         = espData.steer.absAngle;

  // PID
  doc["gainP"]            = espData.steer.gainP;
  doc["pidInputFilt"]     = espData.steer.pidInputFilt;
  doc["pidOutputFilt"]    = espData.steer.pidOutputFilt;
  doc["pidCmd"]           = espData.steer.pidCmd;
  doc["pidOutput"]        = espData.steer.pidOutput;
  doc["pidInput"]         = espData.steer.pidInput;

  // Motor / PWM
  doc["pwmCmd"]           = espData.steer.pwmCmd;
  doc["motorDirection"]   = espData.steer.motorDirection;
  doc["highPWM"]          = espData.steer.highPWM;
  doc["lowPWM"]           = espData.steer.lowPWM;
  doc["minPWM"]           = espData.steer.minPWM;
  doc["minCmd"]           = espData.steer.minCmd;
  doc["maxCmd"]           = espData.steer.maxCmd;
  doc["minScalar"]        = espData.steer.minScalar;
  doc["maxScalar"]        = espData.steer.maxScalar;

  // Current monitoring
  doc["steerCurrent"]       = espData.steer.steerCurrent;
  doc["rawCurrentADC"]      = espData.steer.rawCurrentADC;
  doc["currentBeforeFilter"]= espData.steer.currentBeforeFilter;
  doc["currentZero"]        = espData.steer.currentZero;
  doc["currentScaler"]      = espData.steer.currentScaler;
  doc["currentFilter"]      = espData.steer.currentFilter;
  doc["enableCurrentLimit"] = espData.steer.enableCurrentLimit;
  doc["currentLimit"]       = espData.steer.currentLimit;
  doc["currentLimitTripped"]= espData.steer.currentLimitTripped;
  doc["enableCurrentDebug"] = espData.steer.enableCurrentDebug;

  // WAS configuration
  doc["countsPerDeg"]     = espData.steer.countsPerDeg;
  doc["steerOffset"]      = espData.steer.steerOffset;
  doc["ackermanFix"]      = espData.steer.ackermanFix;
  doc["invertWAS"]        = espData.steer.invertWAS;
  doc["wirelessWAS"]      = espData.steer.wirelessWAS;
  doc["wasFilterValue"]   = espData.steer.wasFilterValue;

  // Performance
  doc["looptime"]         = espData.steer.looptime;
  doc["steerMsgRate"]     = espData.steer.steerMsgRate;

  String response;
  serializeJson(doc, response);
  request->send(200, "application/json", response);
}

// Reboot handler
void handleReboot(AsyncWebServerRequest *request) {
  request->send(200, "text/plain", "Rebooting...");
  delay(100); // Give some time for the response to be sent
  ESP.restart();
}

// Settings page handler
void handleSettingsPage(AsyncWebServerRequest *request) {
  Serial.println("=== SETTINGS PAGE REQUEST ===");
  Serial.println("Client IP: " + request->client()->remoteIP().toString());
  Serial.println("Request Method: " + String(request->methodToString()));
  Serial.println("Request URL: " + request->url());
  Serial.println("Serving settings page HTML...");
  
  String html = "<!DOCTYPE html><html><head><title>ESP32-AIO Settings</title>";
  html += "<meta charset='utf-8'><meta name='viewport' content='width=device-width, initial-scale=1'>";
  html += "<style>";
  html += "body { font-family: Arial, sans-serif; margin: 20px; background-color: #f0f0f0; }";
  html += ".container { max-width: 800px; margin: 0 auto; background-color: white; padding: 20px; border-radius: 10px; box-shadow: 0 0 10px rgba(0,0,0,0.1); }";
  html += ".header { text-align: center; color: #333; margin-bottom: 30px; }";
  html += ".section { margin-bottom: 25px; padding: 15px; border: 1px solid #ddd; border-radius: 8px; background-color: #f9f9f9; }";
  html += ".section-title { font-weight: bold; color: #0066cc; margin-bottom: 15px; font-size: 18px; }";
  html += ".form-group { margin-bottom: 15px; display: flex; align-items: center; }";
  html += ".form-group label { min-width: 200px; font-weight: bold; }";
  html += ".form-group input, .form-group select { flex: 1; padding: 8px; border: 1px solid #ccc; border-radius: 4px; }";
  html += ".button { background-color: #0066cc; color: white; padding: 12px 24px; border: none; border-radius: 5px; cursor: pointer; margin: 10px 5px; font-size: 16px; }";
  html += ".button:hover { background-color: #0052a3; }";
  html += ".button.danger { background-color: #cc0000; }";
  html += ".button.danger:hover { background-color: #a30000; }";
  html += ".status { margin-top: 20px; padding: 10px; border-radius: 5px; text-align: center; }";
  html += ".status.success { background-color: #d4edda; color: #155724; border: 1px solid #c3e6cb; }";
  html += ".status.error { background-color: #f8d7da; color: #721c24; border: 1px solid #f5c6cb; }";
  html += ".network-item { display: flex; align-items: center; justify-content: space-between; padding: 8px 12px; border: 1px solid #e0e0e0; border-radius: 6px; margin-bottom: 6px; background: #fff; font-size: 0.875rem; }";
  html += ".network-item .ssid { font-weight: bold; }";
  html += ".network-item button { margin: 0; padding: 5px 12px; font-size: 0.8rem; }";
  html += "@media (max-width: 600px) { .form-group { flex-direction: column; align-items: flex-start; } .form-group label { min-width: auto; margin-bottom: 5px; } }";
  html += "</style></head><body>";
  
  html += "<div class='container'>";
  html += "<div class='header'><h1>ESP32-AIO Settings</h1></div>";
  
  // WiFi Mode Section
  html += "<div class='section'>";
  html += "<div class='section-title'>WiFi Mode</div>";
  html += "<div class='form-group'><label>Mode:</label><select id='wifi_mode'>";
  html += "<option value='0'>AP Only (Access Point)</option>";
  html += "<option value='1'>AP + STA (connect to network while hosting AP)</option>";
  html += "<option value='2'>STA Only (connect to network, no AP)</option>";
  html += "</select></div>";
  html += "</div>";

