stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  // Access Point Section
  html += "<div class='section'>";
  html += "<div class='section-title'>Access Point</div>";
  html += "<div class='form-group'><label>AP SSID:</label><input type='text' id='ap_ssid' placeholder='ESP32_AIO'></div>";
  html += "<div class='form-group'><label>AP Password:</label><input type='password' id='ap_pass' placeholder='1234567890'></div>";
  html += "<div class='form-group'><label>AP IP Last Octet:</label><input type='number' id='ap_ip3' min='1' max='254' placeholder='1'></div>";
  html += "</div>";

  // STA Networks Section
  html += "<div class='section'>";
  html += "<div class='section-title'>WiFi Networks (STA)</div>";
  html += "<p style='font-size:0.875rem;color:#555;margin-bottom:10px;'>Networks the module will connect to in AP+STA or STA Only modes. Up to 4 networks.</p>";
  html += "<div id='networkList'><p style='color:#888;'>Loading...</p></div>";
  html += "<div class='form-group' style='margin-top:14px;'><label>SSID:</label><input type='text' id='new_ssid' placeholder='Network SSID'></div>";
  html += "<div class='form-group'><label>Password:</label><input type='password' id='new_pass' placeholder='Network Password'></div>";
  html += "<button class='button' onclick='addNetwork()'>Add Network</button>";
  html += "<p id='networkMsg' style='margin-top:8px;'></p>";
  html += "</div>";
  
  // Steering Settings Section
  html += "<div class='section'>";
  html += "<div class='section-title'>Steering Configuration</div>";
  html += "<div class='form-group'><label>PID Gain (Kp):</label><input type='number' id='kp' step='0.1' min='0' max='255'></div>";
  html += "<div class='form-group'><label>High PWM:</label><input type='number' id='highPWM' min='0' max='255'></div>";
  html += "<div class='form-group'><label>Low PWM:</label><input type='number' id='lowPWM' min='0' max='255'></div>";
  html += "<div class='form-group'><label>Min PWM:</label><input type='number' id='minPWM' min='0' max='255'></div>";
  html += "<div class='form-group'><label>Counts Per Degree:</label><input type='number' id='countsPerDeg' step='0.1' min='0'></div>";
  html += "<div class='form-group'><label>WAS Offset:</label><input type='number' id='wasOffset' step='1' min='-2048' max='2048'></div>";
  html += "<div class='form-group'><label>PID Input Filter:</label><input type='number' id='pidInputFilt' step='0.01' min='0' max='1'></div>";
  html += "<div class='form-group'><label>PID Output Filter:</label><input type='number' id='pidOutputFilt' step='0.01' min='0' max='1'></div>";
  html += "<div class='form-group'><label>WAS Voltage Filter:</label><input type='number' id='wasFilter' step='0.01' min='0' max='1'></div>";
  html += "<div class='form-group'><label>Use ADS1115:</label><select id='useADS'><option value='1'>Yes</option><option value='0'>No</option></select></div>";
  html += "</div>";
  
  // Motor Current Sensor Settings Section
  html += "<div class='section'>";
  html += "<div class='section-title'>Motor Current Sensor Calibration</div>";
  html += "<p style='font-size:0.875rem;color:#555;margin-bottom:10px;'>Configure ADS1115 channel 2 current sensor. Output range: 1-254</p>";
  html += "<div class='form-group'><label>Current Zero Point (ADC):</label><input type='number' id='currentZero' min='0' max='65535' step='1' title='ADC value at 0 amps, typically 32767 for mid-scale sensors'></div>";
  html += "<div class='form-group'><label>Current Filter (0-1):</label><input type='number' id='currentFilter' min='0' max='1' step='0.05' title='Weight given to new sample (e.g. 0.3 = 30% new, 70% old)'></div>";
  html += "<div class='form-group'><label>Current Scaler:</label><input type='number' id='currentScaler' min='0' max='5' step='0.1' title='Output multiplier (1.0 = no scaling)'></div>";
  html += "<div class='form-group'><label>Enable Current Limit:</label><select id='enableCurrentLimit' title='Automatically disable steering when current exceeds limit'><option value='0'>Disabled</option><option value='1'>Enabled</option></select></div>";
  html += "<div class='form-group'><label>Current Limit (1-254):</label><input type='number' id='currentLimit' min='1' max='254' step='1' title='Current threshold to disable steering for overload protection'></div>";
  html += "</div>";
  
  // System Settings Section
  html += "<div class='section'>";
  html += "<div class='section-title'>System Configuration</div>";
  html += "<div class='form-group'><label>GPS Source:</label><select id='gpsSource'><option value='0'>On-board GPS</option><option value='1'>Wireless GPS</option></select></div>";
  html += "<div class='form-group'><label>GPS Output Mode:</label><select id='pandaMode'><option value='0'>Raw NMEA Forward</option><option value='1'>PANDA Generation</option></select></div>";
  html += "<div class='form-group'><label>WAS Source:</label><select id='wasSource'><option value='0'>Wired WAS</option><option value='1'>Wireless WAS</option></select></div>";
  html += "<div class='form-group'><label>LED Brightness (0-255):</label><input type='number' id='ledBrightness' min='0' max='255'></div>";
  html += "<div class='form-group'><label>ADS Address:</label><select id='adsAddress'><option value='0x48'>0x48</option><option value='0x49'>0x49</option><option value='0x4A'>0x4A</option><option value='0x4B'>0x4B</option></select></div>";
  html += "<div class='form-group'><label>Flip Pitch/Roll:</label><select id='flipPitchRoll'><option value='0'>Disabled</option><option value='1'>Enabled</option></select></div>";
  html += "<div class='form-group'><label>Invert Roll:</label><select id='invertRoll'><option value='0'>Disabled</option><option value='1'>Enabled</option></select></div>";
  html += "<div class='form-group'><label>Disable Heading Output:</label><select id='disableHeading'><option value='0'>No (Send Heading)</option><option value='1'>Yes (Pitch/Roll Only)</option></select></div>";
  html += "</div>";
  
  // Settings Import/Export Section
  html += "<div class='section'>";
  html += "<div class='section-title'>Backup & Restore</div>";
  html += "<p style='font-size:0.875rem;color:#555;margin-bottom:10px;'>Export settings to backup or transfer to another module. Import to restore settings.</p>";
  html += "<div style='display: flex; gap: 10px; flex-wrap: wrap;'>";
  html += "<button class='button' onclick='exportSettings()'>📥 Download Settings</button>";
  html += "<div>";
  html += "<input type='file' id='importFile' accept='.json' style='display:none' onchange='importSettings()'>";
  html += "<button class='button' onclick='document.getElementById(\"importFile\").click()'>📤 Upload Settings</button>";
  html += "</div>";
  html += "</div>";
  html += "<p id='importStatus' style='margin-top:8px; color:#666;'></p>";
  html += "</div>";
  
  // Action buttons
  html += "<div style='text-align: center; margin-top: 30px;'>";
  html += "<button class='button' onclick='saveSettings()'>Save Settings</button>";
  html += "<button class='button danger' onclick='window.history.back()'>Back</button>";
  html += "</div>";
  
