stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  html += "<div id='status' class='status' style='display: none;'></div>";
  html += "</div>";
  
  // JavaScript
  html += "<script>";
  html += "function escapeHtml(str) { return str.replace(/&/g,'&amp;').replace(/</g,'&lt;').replace(/>/g,'&gt;').replace(/\"/g,'&quot;'); }";
  
  html += "function renderNetworkList(networks) {";
  html += "  console.log('renderNetworkList called with:', networks);";
  html += "  const container = document.getElementById('networkList');";
  html += "  container.innerHTML = '';";
  html += "  if (!networks || networks.length === 0) { container.innerHTML = '<p style=\"color:#888;\">No networks configured.</p>'; return; }";
  html += "  networks.forEach(function(net, idx) {";
  html += "    console.log('Rendering network', idx, ':', net.ssid);";
  html += "    const item = document.createElement('div');";
  html += "    item.className = 'network-item';";
  html += "    const btn = document.createElement('button');";
  html += "    btn.className = 'button danger';";
  html += "    btn.textContent = 'Remove';";
  html += "    btn.onclick = function() { removeNetwork(idx, net.ssid); };";
  html += "    const span = document.createElement('span');";
  html += "    span.className = 'ssid';";
  html += "    span.textContent = net.ssid;";
  html += "    item.appendChild(span);";
  html += "    item.appendChild(btn);";
  html += "    container.appendChild(item);";
  html += "  });";
  html += "}";

  html += "function showStatus(message, isError) {";
  html += "  const status = document.getElementById('status');";
  html += "  status.textContent = message;";
  html += "  status.className = 'status ' + (isError ? 'error' : 'success');";
  html += "  status.style.display = 'block';";
  html += "  setTimeout(() => status.style.display = 'none', 5000);";
  html += "}";
  
  html += "function loadSettings() {";
  html += "  console.log('Loading settings...');";
  html += "  fetch('/getSettings')";
  html += "    .then(r => { if (!r.ok) throw new Error('HTTP ' + r.status); return r.json(); })";
  html += "    .then(data => {";
  html += "      console.log('Settings loaded:', data);";
  html += "      console.log('wifi_mode:', data.wifi_mode);";
  html += "      console.log('sta_networks:', data.sta_networks);";
  html += "      if (data.wifi_mode !== undefined) document.getElementById('wifi_mode').value = String(data.wifi_mode);";
  html += "      if (data.ap_ssid !== undefined) document.getElementById('ap_ssid').value = data.ap_ssid;";
  html += "      if (data.ap_pass !== undefined) document.getElementById('ap_pass').value = data.ap_pass;";
  html += "      if (data.ap_ip3  !== undefined) document.getElementById('ap_ip3').value  = data.ap_ip3;";
  html += "      renderNetworkList(data.sta_networks || []);";
  html += "      if (data.kp !== undefined) document.getElementById('kp').value = data.kp;";
  html += "      if (data.highPWM !== undefined) document.getElementById('highPWM').value = data.highPWM;";
  html += "      if (data.lowPWM !== undefined) document.getElementById('lowPWM').value = data.lowPWM;";
  html += "      if (data.minPWM !== undefined) document.getElementById('minPWM').value = data.minPWM;";
  html += "      if (data.countsPerDeg !== undefined) document.getElementById('countsPerDeg').value = data.countsPerDeg;";
  html += "      if (data.wasOffset !== undefined) document.getElementById('wasOffset').value = data.wasOffset;";
  html += "      if (data.pidInputFilt !== undefined) document.getElementById('pidInputFilt').value = data.pidInputFilt;";
  html += "      if (data.pidOutputFilt !== undefined) document.getElementById('pidOutputFilt').value = data.pidOutputFilt;";
  html += "      if (data.wasFilter !== undefined) document.getElementById('wasFilter').value = data.wasFilter;";
  html += "      if (data.useADS !== undefined) document.getElementById('useADS').value = data.useADS;";
  html += "      if (data.currentZero !== undefined) document.getElementById('currentZero').value = data.currentZero;";
  html += "      if (data.currentFilter !== undefined) document.getElementById('currentFilter').value = data.currentFilter;";
  html += "      if (data.currentScaler !== undefined) document.getElementById('currentScaler').value = data.currentScaler;";
  html += "      if (data.enableCurrentLimit !== undefined) document.getElementById('enableCurrentLimit').value = String(data.enableCurrentLimit);";
  html += "      if (data.currentLimit !== undefined) document.getElementById('currentLimit').value = data.currentLimit;";
  html += "      if (data.gpsSource !== undefined) document.getElementById('gpsSource').value = data.gpsSource;";
  html += "      if (data.pandaMode !== undefined) document.getElementById('pandaMode').value = data.pandaMode;";
  html += "      if (data.wasSource !== undefined) document.getElementById('wasSource').value = data.wasSource;";
  html += "      if (data.ledBrightness !== undefined) document.getElementById('ledBrightness').value = data.ledBrightness;";
  html += "      if (data.adsAddress !== undefined) document.getElementById('adsAddress').value = data.adsAddress;";
  html += "      if (data.flipPitchRoll !== undefined) document.getElementById('flipPitchRoll').value = data.flipPitchRoll;";
  html += "      if (data.invertRoll !== undefined) document.getElementById('invertRoll').value = data.invertRoll;";
  html += "      if (data.disableHeading !== undefined) document.getElementById('disableHeading').value = data.disableHeading;";
  html += "      showStatus('Settings loaded', false);";
  html += "    })";
  html += "    .catch(error => { console.error('Load settings error:', error); showStatus('Failed to load settings: ' + error, true); });";
  html += "}";
  
  html += "function saveSettings() {";
  html += "  console.log('saveSettings called');";
  html += "  const formData = new FormData();";
  html += "  const wifiMode = document.getElementById('wifi_mode').value;";
  html += "  console.log('wifi_mode value:', wifiMode);";
  html += "  formData.append('wifi_mode', wifiMode);";
  html += "  formData.append('ap_ssid', document.getElementById('ap_ssid').value);";
  html += "  formData.append('ap_pass', document.getElementById('ap_pass').value);";
  html += "  formData.append('ap_ip3', document.getElementById('ap_ip3').value);";
  html += "  formData.append('kp', parseFloat(document.getElementById('kp').value) || 50);";
  html += "  formData.append('highPWM', parseInt(document.getElementById('highPWM').value) || 255);";
  html += "  formData.append('lowPWM', parseInt(document.getElementById('lowPWM').value) || 10);";
  html += "  formData.append('minPWM', parseInt(document.getElementById('minPWM').value) || 5);";
  html += "  formData.append('countsPerDeg', parseFloat(document.getElementById('countsPerDeg').value) || 10);";
  html += "  formData.append('wasOffset', parseInt(document.getElementById('wasOffset').value) || 0);";
  html += "  formData.append('pidInputFilt', parseFloat(document.getElementById('pidInputFilt').value) || 0.1);";
  html += "  formData.append('pidOutputFilt', parseFloat(document.getElementById('pidOutputFilt').value) || 0.1);";
  html += "  formData.append('wasFilter', parseFloat(document.getElementById('wasFilter').value) || 0.2);";
  html += "  formData.append('useADS', document.getElementById('useADS').value);";
  html += "  formData.append('currentZero', parseInt(document.getElementById('currentZero').value) || 32767);";
  html += "  formData.append('currentFilter', parseFloat(document.getElementById('currentFilter').value) || 0.3);";
  html += "  formData.append('currentScaler', parseFloat(document.getElementById('currentScaler').value) || 1.0);";
  html += "  formData.append('enableCurrentLimit', document.getElementById('enableCurrentLimit').value);";
  html += "  formData.append('currentLimit', parseInt(document.getElementById('currentLimit').value) || 200);";
  html += "  formData.append('gpsSource', document.getElementById('gpsSource').value);";
  html += "  formData.append('pandaMode', document.getElementById('pandaMode').value);";
  html += "  formData.append('wasSource', document.getElementById('wasSource').value);";
  html += "  formData.append('ledBrightness', parseInt(document.getElementById('ledBrightness').value) || 100);";
  html += "  formData.append('flipPitchRoll', document.getElementById('flipPitchRoll').value);";
  html += "  formData.append('invertRoll', document.getElementById('invertRoll').value);";
  html += "  formData.append('disableHeading', document.getElementById('disableHeading').value);";
  html += "  console.log('Sending POST to /saveSettings');";
  html += "  fetch('/saveSettings', { method: 'POST', body: formData })";
  html += "    .then(r => { console.log('Response received:', r.status); return r.text(); })";
  html += "    .then(data => { console.log('Response data:', data); showStatus(data, false); })";
  html += "    .catch(error => { console.error('Save error:', error); showStatus('Failed to save settings: ' + error, true); });";
  html += "}";

  html += "function addNetwork() {";
  html += "  const ssid = document.getElementById('new_ssid').value.trim();";
  html += "  const pass = document.getElementById('new_pass').value;";
  html += "  const msgEl = document.getElementById('networkMsg');";
  html += "  if (!ssid) { msgEl.textContent = 'SSID cannot be empty.'; msgEl.style.color = 'red'; return; }";
  html += "  const formData = new URLSearchParams();";
  html += "  formData.append('ssid', ssid); formData.append('pass', pass);";
  html += "  fetch('/addNetwork', { method: 'POST', headers: {'Content-Type':'application/x-www-form-urlencoded'}, body: formData.toString() })";
  html += "    .then(r => r.text())";
  html += "    .then(msg => { msgEl.textContent = msg; msgEl.style.color = msg.includes('added') ? 'green' : 'red'; document.getElementById('new_ssid').value = ''; document.getElementById('new_pass').value = ''; })";
  html += "    .catch(e => { msgEl.textContent = 'Error: ' + e; msgEl.style.color = 'red'; });";
  html += "}";

