stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  html += "function removeNetwork(idx, ssid) {";
  html += "  const msgEl = document.getElementById('networkMsg');";
  html += "  if (!confirm('Remove network \"' + ssid + '\"?')) return;";
  html += "  const formData = new URLSearchParams();";
  html += "  formData.append('index', idx);";
  html += "  fetch('/removeNetwork', { method: 'POST', headers: {'Content-Type':'application/x-www-form-urlencoded'}, body: formData.toString() })";
  html += "    .then(r => r.text())";
  html += "    .then(msg => { msgEl.textContent = msg; msgEl.style.color = msg.includes('removed') ? 'green' : 'red'; })";
  html += "    .catch(e => { msgEl.textContent = 'Error: ' + e; msgEl.style.color = 'red'; });";
  html += "}";
  
  html += "function exportSettings() {";
  html += "  fetch('/exportSettings')";
  html += "    .then(response => response.blob())";
  html += "    .then(blob => {";
  html += "      const url = window.URL.createObjectURL(blob);";
  html += "      const a = document.createElement('a');";
  html += "      a.href = url;";
  html += "      a.download = 'esp32_settings_' + new Date().toISOString().slice(0,10) + '.json';";
  html += "      document.body.appendChild(a);";
  html += "      a.click();";
  html += "      window.URL.revokeObjectURL(url);";
  html += "      document.body.removeChild(a);";
  html += "      showStatus('Settings downloaded successfully', false);";
  html += "    })";
  html += "    .catch(e => { showStatus('Error downloading settings: ' + e, true); });";
  html += "}";
  
  html += "function importSettings() {";
  html += "  const fileInput = document.getElementById('importFile');";
  html += "  const statusEl = document.getElementById('importStatus');";
  html += "  if (!fileInput.files.length) { statusEl.textContent = 'No file selected'; return; }";
  html += "  const file = fileInput.files[0];";
  html += "  if (!file.name.endsWith('.json')) { statusEl.textContent = 'Please select a JSON file'; statusEl.style.color = 'red'; return; }";
  html += "  statusEl.textContent = 'Uploading settings...';";
  html += "  statusEl.style.color = '#666';";
  html += "  const formData = new FormData();";
  html += "  formData.append('file', file);";
  html += "  fetch('/importSettings', { method: 'POST', body: formData })";
  html += "    .then(r => r.text())";
  html += "    .then(msg => {";
  html += "      statusEl.textContent = msg;";
  html += "      statusEl.style.color = msg.includes('success') ? 'green' : 'red';";
  html += "      if (msg.includes('Rebooting')) {";
  html += "        setTimeout(() => { window.location.href = '/'; }, 3000);";
  html += "      } else {";
  html += "        setTimeout(() => { loadSettings(); }, 1000);";
  html += "      }";
  html += "    })";
  html += "    .catch(e => { statusEl.textContent = 'Upload error: ' + e; statusEl.style.color = 'red'; });";
  html += "  fileInput.value = '';";
  html += "}";
  
  html += "window.onload = loadSettings;";
  html += "</script>";
  html += "</body></html>";
  
  Serial.println("Settings page HTML generated, size: " + String(html.length()) + " bytes");
  request->send(200, "text/html", html);
  Serial.println("Settings page sent successfully");
}

// Get current settings as JSON
void handleGetSettings(AsyncWebServerRequest *request) {
  Serial.println("=== GET SETTINGS REQUEST ===");
  
  JsonDocument doc;
  
  // WiFi settings
  Serial.printf("wifiMode: %d\n", espData.wifiMode);
  Serial.printf("staCfg.count: %d\n", espData.staCfg.count);
  
  doc["wifi_mode"] = espData.wifiMode;
  doc["ap_ssid"]   = espData.apCfg.ssid;
  doc["ap_pass"]   = espData.apCfg.password;
  doc["ap_ch"]     = espData.apCfg.channel;
  doc["ap_ip3"]    = espData.apCfg.ips[3];
  JsonArray networks = doc.createNestedArray("sta_networks");
  for (int i = 0; i < espData.staCfg.count; i++) {
    Serial.printf("Network %d: SSID='%s'\n", i, espData.staCfg.ssids[i]);
    JsonObject net = networks.createNestedObject();
    net["ssid"] = espData.staCfg.ssids[i];
    net["pass"] = espData.staCfg.passwords[i];
  }

  // Steering settings
  doc["kp"] = espData.steer.gainP;
  doc["highPWM"] = espData.steer.highPWM;
  doc["lowPWM"] = espData.steer.lowPWM;
  doc["minPWM"] = espData.steer.minPWM;
  doc["countsPerDeg"] = espData.steer.countsPerDeg;
  doc["wasOffset"] = espData.steer.steerOffset;
  doc["pidInputFilt"] = espData.steer.pidInputFilt;
  doc["pidOutputFilt"] = espData.steer.pidOutputFilt;
  doc["wasFilter"] = espData.steer.wasFilterValue;
  doc["useADS"] = espData.steer.useADS;
  
  // Motor current sensor settings
  doc["currentZero"] = espData.steer.currentZero;
  doc["currentFilter"] = espData.steer.currentFilter;
  doc["currentScaler"] = espData.steer.currentScaler;
  int limitValue = espData.steer.enableCurrentLimit ? 1 : 0;
  doc["enableCurrentLimit"] = limitValue;
  Serial.printf("[GET] enableCurrentLimit returned to web: %d (bool value: %d, actual var: %s)\n", 
                limitValue, espData.steer.enableCurrentLimit, 
                espData.steer.enableCurrentLimit ? "true" : "false");
  doc["currentLimit"] = (int)espData.steer.currentLimit;
  
  // System settings
  doc["gpsSource"] = espData.gps.externalGPS ? 1 : 0;
  doc["wasSource"] = espData.steer.wirelessWAS ? 1 : 0;
  doc["ledBrightness"] = espData.program.ledBrht;
  doc["adsAddress"] = "0x48";
  doc["pandaMode"] = espData.gps.ntripPandaMode ? 1 : 0;
  doc["flipPitchRoll"] = espData.gps.flipPitchRoll ? 1 : 0;
  doc["invertRoll"] = espData.gps.invertRoll ? 1 : 0;
  doc["disableHeading"] = espData.gps.disableHeading ? 1 : 0;
  
  String response;
  serializeJson(doc, response);
  Serial.println("JSON Response:");
  Serial.println(response);
  request->send(200, "application/json", response);
  Serial.println("Settings JSON sent successfully");
}

// Save settings from JSON POST
void handleSaveSettings(AsyncWebServerRequest *request) {
  Serial.println("=== SAVE SETTINGS REQUEST ===");
  
  // Log all received parameters
  int params = request->params();
  Serial.printf("Received %d parameters:\n", params);
  for(int i = 0; i < params; i++){
    const AsyncWebParameter* p = request->getParam(i);
    Serial.printf("  %s = %s\n", p->name().c_str(), p->value().c_str());
  }
  
  bool doReboot = false;

  // WiFi / AP settings (require reboot)
  if (request->hasParam("ap_ssid", true)) {
    String v = request->getParam("ap_ssid", true)->value();
    if (v.length() > 0 && v.length() < 64) {
      snprintf(espData.apCfg.ssid, sizeof(espData.apCfg.ssid), "%s", v.c_str());
      doReboot = true;
    }
  }
  if (request->hasParam("ap_pass", true)) {
    String v = request->getParam("ap_pass", true)->value();
    if (v.length() > 0 && v.length() < 64) {
      snprintf(espData.apCfg.password, sizeof(espData.apCfg.password), "%s", v.c_str());
      doReboot = true;
    }
  }
  if (request->hasParam("ap_ip3", true)) {
    int ip3 = request->getParam("ap_ip3", true)->value().toInt();
    if (ip3 >= 1 && ip3 <= 254) {
      espData.apCfg.ips[3] = ip3;
      doReboot = true;
    }
  }
  if (request->hasParam("wifi_mode", true)) {
    int mode = request->getParam("wifi_mode", true)->value().toInt();
    Serial.println("Received wifi_mode: " + String(mode));
    if (mode >= 0 && mode <= 2) {
      espData.wifiMode = mode;
      Serial.println("Set wifiMode to: " + String(espData.wifiMode));
      doReboot = true;
    } else {
      Serial.println("Invalid wifi_mode value: " + String(mode));
    }
  }

