stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  // Steering settings
  if (request->hasParam("kp", true)) {
    espData.steer.gainP = request->getParam("kp", true)->value().toFloat();
  }
  if (request->hasParam("highPWM", true)) {
    espData.steer.highPWM = request->getParam("highPWM", true)->value().toInt();
  }
  if (request->hasParam("lowPWM", true)) {
    espData.steer.lowPWM = request->getParam("lowPWM", true)->value().toInt();
  }
  if (request->hasParam("minPWM", true)) {
    espData.steer.minPWM = request->getParam("minPWM", true)->value().toInt();
  }
  if (request->hasParam("countsPerDeg", true)) {
    espData.steer.countsPerDeg = request->getParam("countsPerDeg", true)->value().toFloat();
  }
  if (request->hasParam("wasOffset", true)) {
    espData.steer.steerOffset = request->getParam("wasOffset", true)->value().toInt();
  }
  if (request->hasParam("pidInputFilt", true)) {
    float oldValue = espData.steer.pidInputFilt;
    espData.steer.pidInputFilt = request->getParam("pidInputFilt", true)->value().toFloat();
    Serial.println("  PID Input Filter: " + String(oldValue) + " -> " + String(espData.steer.pidInputFilt));
  }
  if (request->hasParam("pidOutputFilt", true)) {
    espData.steer.pidOutputFilt = request->getParam("pidOutputFilt", true)->value().toFloat();
  }
  if (request->hasParam("wasFilter", true)) {
    espData.steer.wasFilterValue = request->getParam("wasFilter", true)->value().toFloat();
  }
  if (request->hasParam("useADS", true)) {
    espData.steer.useADS = request->getParam("useADS", true)->value().toInt();
  }
  
  // Motor current sensor settings
  if (request->hasParam("currentZero", true)) {
    espData.steer.currentZero = request->getParam("currentZero", true)->value().toInt();
  }
  if (request->hasParam("currentFilter", true)) {
    espData.steer.currentFilter = request->getParam("currentFilter", true)->value().toFloat();
  }
  if (request->hasParam("currentScaler", true)) {
    espData.steer.currentScaler = request->getParam("currentScaler", true)->value().toFloat();
  }
  if (request->hasParam("enableCurrentLimit", true)) {
    String rawValue = request->getParam("enableCurrentLimit", true)->value();
    int newValue = rawValue.toInt();
    Serial.printf("[WEB] enableCurrentLimit received: raw='%s' int=%d (was: %d)\n", 
                  rawValue.c_str(), newValue, espData.steer.enableCurrentLimit);
    espData.steer.enableCurrentLimit = (bool)newValue;
    Serial.printf("[WEB] enableCurrentLimit after assignment: %d (bool=%s)\n",
                  espData.steer.enableCurrentLimit, espData.steer.enableCurrentLimit ? "true" : "false");
  }
  if (request->hasParam("currentLimit", true)) {
    espData.steer.currentLimit = request->getParam("currentLimit", true)->value().toInt();
  }
  
  // System settings
  if (request->hasParam("gpsSource", true)) {
    espData.gps.externalGPS = request->getParam("gpsSource", true)->value().toInt();
  }
  if (request->hasParam("wasSource", true)) {
    espData.steer.wirelessWAS = request->getParam("wasSource", true)->value().toInt();
  }
  if (request->hasParam("ledBrightness", true)) {
    espData.program.ledBrht = request->getParam("ledBrightness", true)->value().toInt();
    myLED.updateBrightness();
  }
  if (request->hasParam("pandaMode", true)) {
    espData.gps.ntripPandaMode = request->getParam("pandaMode", true)->value().toInt();
  }
  if (request->hasParam("flipPitchRoll", true)) {
    espData.gps.flipPitchRoll = request->getParam("flipPitchRoll", true)->value().toInt();
  }
  if (request->hasParam("invertRoll", true)) {
    espData.gps.invertRoll = request->getParam("invertRoll", true)->value().toInt();
  }
  if (request->hasParam("disableHeading", true)) {
    espData.gps.disableHeading = request->getParam("disableHeading", true)->value().toInt();
  }
  
  bool saveResult = espData.saveConfig();
  if (saveResult) {
    String msg = doReboot ? "Settings saved. Rebooting..." : "Settings saved successfully!";
    request->send(200, "text/plain", msg);
    if (doReboot) { delay(500); ESP.restart(); }
  } else {
    request->send(500, "text/plain", "Failed to save settings to memory");
  }
  Serial.println("=== SAVE SETTINGS COMPLETE ===");
}

void handleAddNetwork(AsyncWebServerRequest *request) {
  Serial.println("=== ADD NETWORK REQUEST ===");
  if (!request->hasParam("ssid", true)) {
    request->send(400, "text/plain", "Missing ssid");
    return;
  }
  String ssid = request->getParam("ssid", true)->value();
  String pass = request->hasParam("pass", true) ? request->getParam("pass", true)->value() : "";
  ssid.trim();
  
  Serial.println("SSID: " + ssid);
  Serial.println("Pass length: " + String(pass.length()));
  
  if (ssid.length() == 0 || ssid.length() >= 64) {
    request->send(400, "text/plain", "SSID must be 1–63 characters");
    return;
  }
  if (pass.length() >= 64) {
    request->send(400, "text/plain", "Password must be fewer than 64 characters");
    return;
  }
  int count = espData.getInt("sta_count", 0);
  Serial.println("Current network count: " + String(count));
  
  if (count >= ESPdata::STAConfig::MAX_NETWORKS) {
    request->send(400, "text/plain", "Maximum number of networks reached");
    return;
  }
  for (int i = 0; i < count; i++) {
    String keySSID = "sta_ssid_" + String(i);
    if (espData.getString(keySSID.c_str(), "") == ssid) {
      request->send(400, "text/plain", "Network already exists");
      return;
    }
  }
  
  // Save to preferences
  String keySSID = "sta_ssid_" + String(count);
  String keyPass = "sta_pass_" + String(count);
  espData.putString(keySSID.c_str(), ssid);
  espData.putString(keyPass.c_str(), pass);
  espData.putInt("sta_count", count + 1);
  
  // Also update in-memory structure
  strncpy(espData.staCfg.ssids[count], ssid.c_str(), sizeof(espData.staCfg.ssids[count]) - 1);
  strncpy(espData.staCfg.passwords[count], pass.c_str(), sizeof(espData.staCfg.passwords[count]) - 1);
  espData.staCfg.ssids[count][sizeof(espData.staCfg.ssids[count]) - 1] = '\0';
  espData.staCfg.passwords[count][sizeof(espData.staCfg.passwords[count]) - 1] = '\0';
  espData.staCfg.count = count + 1;
  
