stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
  Serial.println("Network added successfully. New count: " + String(espData.staCfg.count));
  request->send(200, "text/plain", "Network added. Rebooting...");
  delay(500);
  ESP.restart();
}

void handleRemoveNetwork(AsyncWebServerRequest *request) {
  Serial.println("=== REMOVE NETWORK REQUEST ===");
  if (!request->hasParam("index", true)) {
    request->send(400, "text/plain", "Missing index");
    return;
  }
  int idx   = request->getParam("index", true)->value().toInt();
  int count = espData.getInt("sta_count", 0);
  
  Serial.println("Removing network at index: " + String(idx));
  Serial.println("Current network count: " + String(count));
  
  if (idx < 0 || idx >= count) {
    request->send(400, "text/plain", "Invalid index");
    return;
  }
  
  // Shift networks in preferences
  for (int i = idx; i < count - 1; i++) {
    String keySSID_src = "sta_ssid_" + String(i + 1);
    String keyPass_src = "sta_pass_" + String(i + 1);
    String keySSID_dst = "sta_ssid_" + String(i);
    String keyPass_dst = "sta_pass_" + String(i);
    espData.putString(keySSID_dst.c_str(),
        espData.getString(keySSID_src.c_str(), ""));
    espData.putString(keyPass_dst.c_str(),
        espData.getString(keyPass_src.c_str(), ""));
        
    // Also update in-memory structure
    strncpy(espData.staCfg.ssids[i], espData.staCfg.ssids[i + 1], sizeof(espData.staCfg.ssids[i]) - 1);
    strncpy(espData.staCfg.passwords[i], espData.staCfg.passwords[i + 1], sizeof(espData.staCfg.passwords[i]) - 1);
    espData.staCfg.ssids[i][sizeof(espData.staCfg.ssids[i]) - 1] = '\0';
    espData.staCfg.passwords[i][sizeof(espData.staCfg.passwords[i]) - 1] = '\0';
  }
  
  // Remove last network entry
  String keySSID_last = "sta_ssid_" + String(count - 1);
  String keyPass_last = "sta_pass_" + String(count - 1);
  espData.remove(keySSID_last.c_str());
  espData.remove(keyPass_last.c_str());
  espData.putInt("sta_count", count - 1);
  
  // Update in-memory count
  espData.staCfg.count = count - 1;
  
  Serial.println("Network removed successfully. New count: " + String(espData.staCfg.count));
  request->send(200, "text/plain", "Network removed. Rebooting...");
  delay(500);
  ESP.restart();
}

// Export settings as downloadable JSON file
void handleExportSettings(AsyncWebServerRequest *request) {
  Serial.println("=== EXPORT SETTINGS REQUEST ===");
  
  JsonDocument doc;
  
  // WiFi settings
  doc["wifi_mode"] = espData.wifiMode;
  doc["ap_ssid"]   = espData.apCfg.ssid;
  doc["ap_pass"]   = espData.apCfg.password;
  doc["ap_ch"]     = espData.apCfg.channel;
  doc["ap_ip3"]    = espData.apCfg.ips[3];
  JsonArray networks = doc.createNestedArray("sta_networks");
  for (int i = 0; i < espData.staCfg.count; i++) {
    JsonObject net = networks.createNestedObject();
    net["ssid"] = espData.staCfg.ssids[i];
    net["pass"] = espData.staCfg.passwords[i];
  }

  // Steering settings
  doc["kp"] = espData.steer.gainP;
  doc["highPWM"] = espData.steer.highPWM;
  doc["lowPWM"] = espData.steer.lowPWM;
  doc["minPWM"] = espData.steer.minPWM;
  doc["countsPerDeg"] = espData.steer.countsPerDeg;
  doc["wasOffset"] = espData.steer.steerOffset;
  doc["pidInputFilt"] = espData.steer.pidInputFilt;
  doc["pidOutputFilt"] = espData.steer.pidOutputFilt;
  doc["wasFilter"] = espData.steer.wasFilterValue;
  doc["useADS"] = espData.steer.useADS;
  
  // Motor current sensor settings
  doc["currentZero"] = espData.steer.currentZero;
  doc["currentFilter"] = espData.steer.currentFilter;
  doc["currentScaler"] = espData.steer.currentScaler;
  doc["enableCurrentLimit"] = espData.steer.enableCurrentLimit ? 1 : 0;
  doc["currentLimit"] = (int)espData.steer.currentLimit;
  
  // System settings
  doc["gpsSource"] = espData.gps.externalGPS ? 1 : 0;
  doc["wasSource"] = espData.steer.wirelessWAS ? 1 : 0;
  doc["ledBrightness"] = espData.program.ledBrht;
  doc["adsAddress"] = "0x48";
  doc["pandaMode"] = espData.gps.ntripPandaMode ? 1 : 0;
  doc["flipPitchRoll"] = espData.gps.flipPitchRoll ? 1 : 0;
  doc["invertRoll"] = espData.gps.invertRoll ? 1 : 0;
  doc["disableHeading"] = espData.gps.disableHeading ? 1 : 0;
  
  String response;
  serializeJson(doc, response);
  
  AsyncWebServerResponse *downloadResponse = request->beginResponse(200, "application/json", response);
  downloadResponse->addHeader("Content-Disposition", "attachment; filename=\"esp32_settings.json\"");
  request->send(downloadResponse);
  
  Serial.println("Settings exported successfully");
}

// Import settings from uploaded JSON file
void handleImportSettings(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
  static String jsonBuffer;
  
  if (!index) {
    Serial.println("=== IMPORT SETTINGS REQUEST ===");
    jsonBuffer = "";
  }
  
  // Accumulate data
  for (size_t i = 0; i < len; i++) {
    jsonBuffer += (char)data[i];
  }
  
  if (final) {
    Serial.println("Received JSON:");
    Serial.println(jsonBuffer);
    
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, jsonBuffer);
    
    if (error) {
      Serial.print("JSON parse error: ");
      Serial.println(error.c_str());
      request->send(400, "text/plain", "Invalid JSON file");
      return;
    }
    
    bool doReboot = false;
    
    // WiFi / AP settings
    if (doc.containsKey("wifi_mode")) {
      espData.wifiMode = doc["wifi_mode"];
      doReboot = true;
    }
    if (doc.containsKey("ap_ssid")) {
      String v = doc["ap_ssid"].as<String>();
      if (v.length() > 0 && v.length() < 64) {
        snprintf(espData.apCfg.ssid, sizeof(espData.apCfg.ssid), "%s", v.c_str());
        doReboot = true;
      }
    }
    if (doc.containsKey("ap_pass")) {
      String v = doc["ap_pass"].as<String>();
      if (v.length() > 0 && v.length() < 64) {
        snprintf(espData.apCfg.password, sizeof(espData.apCfg.password), "%s", v.c_str());
        doReboot = true;
      }
    }
    if (doc.containsKey("ap_ip3")) {
      int ip3 = doc["ap_ip3"];
      if (ip3 >= 1 && ip3 <= 254) {
        espData.apCfg.ips[3] = ip3;
        doReboot = true;
      }
    }
    
    // STA networks
    if (doc.containsKey("sta_networks")) {
      JsonArray networks = doc["sta_networks"];
      int count = min((int)networks.size(), (int)ESPdata::STAConfig::MAX_NETWORKS);
      
      for (int i = 0; i < count; i++) {
        JsonObject net = networks[i];
        String ssid = net["ssid"].as<String>();
        String pass = net["pass"].as<String>();
        
        snprintf(espData.staCfg.ssids[i], sizeof(espData.staCfg.ssids[i]), "%s", ssid.c_str());
        snprintf(espData.staCfg.passwords[i], sizeof(espData.staCfg.passwords[i]), "%s", pass.c_str());
      }
      
