stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
      espData.staCfg.count = count;
      doReboot = true;
    }
    
    // Steering settings
    if (doc.containsKey("kp")) {
      espData.steer.gainP = doc["kp"];
    }
    if (doc.containsKey("highPWM")) {
      espData.steer.highPWM = doc["highPWM"];
    }
    if (doc.containsKey("lowPWM")) {
      espData.steer.lowPWM = doc["lowPWM"];
    }
    if (doc.containsKey("minPWM")) {
      espData.steer.minPWM = doc["minPWM"];
    }
    if (doc.containsKey("countsPerDeg")) {
      espData.steer.countsPerDeg = doc["countsPerDeg"];
    }
    if (doc.containsKey("wasOffset")) {
      espData.steer.steerOffset = doc["wasOffset"];
    }
    if (doc.containsKey("pidInputFilt")) {
      espData.steer.pidInputFilt = doc["pidInputFilt"];
    }
    if (doc.containsKey("pidOutputFilt")) {
      espData.steer.pidOutputFilt = doc["pidOutputFilt"];
    }
    if (doc.containsKey("wasFilter")) {
      espData.steer.wasFilterValue = doc["wasFilter"];
    }
    if (doc.containsKey("useADS")) {
      espData.steer.useADS = doc["useADS"];
    }
    
    // Motor current sensor settings
    if (doc.containsKey("currentZero")) {
      espData.steer.currentZero = doc["currentZero"];
    }
    if (doc.containsKey("currentFilter")) {
      espData.steer.currentFilter = doc["currentFilter"];
    }
    if (doc.containsKey("currentScaler")) {
      espData.steer.currentScaler = doc["currentScaler"];
    }
    if (doc.containsKey("enableCurrentLimit")) {
      espData.steer.enableCurrentLimit = doc["enableCurrentLimit"].as<int>() != 0;
    }
    if (doc.containsKey("currentLimit")) {
      espData.steer.currentLimit = doc["currentLimit"];
    }
    
    // System settings
    if (doc.containsKey("gpsSource")) {
      espData.gps.externalGPS = doc["gpsSource"].as<int>() != 0;
    }
    if (doc.containsKey("wasSource")) {
      espData.steer.wirelessWAS = doc["wasSource"].as<int>() != 0;
    }
    if (doc.containsKey("ledBrightness")) {
      espData.program.ledBrht = doc["ledBrightness"];
    }
    if (doc.containsKey("pandaMode")) {
      espData.gps.ntripPandaMode = doc["pandaMode"].as<int>() != 0;
    }
    if (doc.containsKey("flipPitchRoll")) {
      espData.gps.flipPitchRoll = doc["flipPitchRoll"].as<int>() != 0;
    }
    if (doc.containsKey("invertRoll")) {
      espData.gps.invertRoll = doc["invertRoll"].as<int>() != 0;
    }
    if (doc.containsKey("disableHeading")) {
      espData.gps.disableHeading = doc["disableHeading"].as<int>() != 0;
    }
    
    // Save all settings to NVS
    espData.saveConfig();
    
    Serial.println("Settings imported and saved successfully");
    
    if (doReboot) {
      request->send(200, "text/plain", "Settings imported successfully. Rebooting...");
      delay(500);
      ESP.restart();
    } else {
      request->send(200, "text/plain", "Settings imported successfully");
    }
  }
}

// File download handler
// void handleFileDownload(AsyncWebServerRequest *request) {
//   if (request->hasParam("filename")) {
//     String filename = request->getParam("filename")->value();
//     if (LittleFS.exists("/" + filename)) {
//       request->send(LittleFS, "/" + filename, "application/octet-stream");
//     } else {
//       request->send(404, "text/plain", "File not found");
//     }
//   } else {
//     request->send(400, "text/plain", "Filename not provided");
//   }
// }

// File upload handler
void handleFileUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
  if (!index) {
    // Open file for writing
    Serial.printf("UploadStart: %s\n", filename.c_str());
    request->_tempFile = LittleFS.open("/" + filename, "w");
  }
  if (len) {
    // Write the file content
    request->_tempFile.write(data, len);
  }
  if (final) {
    // Close the file
    request->_tempFile.close();
    Serial.printf("UploadEnd: %s, %u B\n", filename.c_str(), index + len);
    request->send(200, "text/plain", "File Uploaded");
  }
}


void handleToggleAPMode(AsyncWebServerRequest *request) {
  static bool apModeState = false;
  apModeState = !apModeState;
  espData.wifi.apMode = apModeState ? 1 : 0;
  Serial.printf("AP Mode State: %s\n", apModeState ? "ON" : "OFF");
  request->send(200, "text/plain", apModeState ? "AP_Mode is ON" : "AP_Mode is OFF");
}



#pragma endregion

#pragma region Buttons
/**
 * @brief Interrupt service routine for handling steering switch activation
 * 
 * @details This ISR is triggered when the steering switch is pressed. It implements
 *          debouncing logic with a 100ms minimum interval between triggers.
 *          Sets the steerSwitch flag and updates the last trigger timestamp.
 *          Must be declared with IRAM_ATTR for interrupt handling on ESP32.
 * 
 * @note This function runs in interrupt context - keep execution time minimal
 * @see handleWorkSwitch(), buttonSetup()
 */
void IRAM_ATTR handleSteerSwitch() {
  unsigned long currentTime = millis();
  if (currentTime - espData.steer.steerSwitchLastTime > 100) {
      espData.steer.steerSwitch = true; // Set the flag
      espData.steer.steerSwitchLastTime = currentTime; // Update the debounce timestamp
    }
}

/**
 * @brief Interrupt service routine for handling work switch activation
 * 
 * @details This ISR is triggered when the work switch is pressed. It implements
 *          debouncing logic with a 100ms minimum interval between triggers.
 *          Sets the workSwitch flag and updates the last trigger timestamp.
 *          Must be declared with IRAM_ATTR for interrupt handling on ESP32.
 * 
 * @note This function runs in interrupt context - keep execution time minimal
 * @see handleSteerSwitch(), buttonSetup()
 */
void IRAM_ATTR handleWorkSwitch() {
  unsigned long currentTime = millis();
  if (currentTime - espData.switches.workSwitchLastTime > 100) {
      espData.switches.workSwitch = true; // Set the flag
      espData.switches.workSwitchLastTime = currentTime; // Update the debounce timestamp
  }
}

/**
 * @brief Configures GPIO pins and interrupt handlers for physical switches
 * 
 * @details This function initializes the hardware button interface by:
 *          - Setting steering and work switch pins as INPUT_PULLUP
 *          - Attaching interrupt handlers for FALLING edge detection
 *          - Enabling hardware debouncing through interrupt configuration
 * 
 * @note Called once during system initialization in setup()
 * @see handleSteerSwitch(), handleWorkSwitch()
 */
void buttonSetup(){
  // Set up the GPIO pins for the buttons
  pinMode(espData.pins.STEER_SWITCH_PIN, INPUT_PULLUP);
  pinMode(espData.pins.WORK_SWITCH_PIN, INPUT_PULLUP);

